package org.caselab.task3;


/*
Необходимо создать иерархию классов для описания нескольких видов транспорта.
[ ] В иерархию должны быть включены как минимум 4 конечных вида транспорта. (например, автомобиль, самолет,
корабль, велосипед и т. д.).
[ ] Пользователь должен иметь возможность создавать объекты разных видов транспорта, вызывать методы для каждого объекта и выводить информацию о транспорте на консоль.
[ ] В иерархию также могут входить такие сущности, как двигатель, топливо и т. д


Требования:
[ ] Реализовать пользовательский интерфейс на свое усмотрение
[+] Обязательно применение запечатанных (Sealed) классов и перечислений (Enum)
[ ] Обязательно корректное применение абстрактных классов или интерфейсов для реализации
иерархии
[ ] Создать UML-диаграмму на основе полученной иерархии, на которой будут указаны отношения
между классами (наследование, реализация, ассоциация)
 */




public class Main {
    public static void main(String[] args) {

    }
}
